app/views/posts/show.html.erb

                                <td><strong>Price:</strong></td>
                                <% if @post.bids.present? %>
---
SELECT  "bids".* FROM "bids" INNER JOIN "posts" ON "posts"."id" = "bids"."post_id" WHERE "bids"."post_id" = 1  ORDER BY created_at DESC LIMIT 1

                                <td><strong>Number of bids:</strong></td>
                                <td><%= link_to (@post.bids.count), post_bids_path(@post) %></td>
---
SELECT COUNT(*) FROM "bids" WHERE "bids"."post_id" = ?  [["post_id", 1]]