app/controllers/bids_controller.rb

SELECT "bids".* FROM "bids" INNER JOIN "posts" ON "posts"."id" = "bids"."post_id" WHERE "bids"."post_id" = 1  ORDER BY created_at
---
  def index
      @bids = Bid.joins(:post).where('post_id' => @post).order("created_at")