app/controllers/bids_controller.rb

SELECT "bids".* FROM "bids" WHERE "bids"."post_id" = 5  ORDER BY created_at
---
  def index
      @bids = Bid.where(post_id: @post.id).order(:created_at)

INSERT INTO "bids" ("amount", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 10000], ["post_id", 2], ["user_id", 2], ["created_at", "2016-09-08 02:08:46.044180"], ["updated_at", "2016-09-08 02:08:46.044180"]]
---
  def create
      if current_user.id != @post.user_id
          if @post.open? || @post.pending?
              @bid = @post.bids.build(bid_params.merge(user_id: current_user.id))
              # Save the bid
              if @bid.save