app/controllers/posts_controller.rb

  def index
    if params[:query].present?
      @posts = Post.search(params[:query])
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def show
    @bid = @post.bids.build
    @most_recent_bid = Bid.joins(:post)
    .where(post_id: params[:id])
    .most_recent
---
SELECT  "bids".* FROM "bids" INNER JOIN "posts" ON "posts"."id" = "bids"."post_id" WHERE "bids"."post_id" = 1  ORDER BY created_at DESC LIMIT 1

  def create
    @post = current_user.posts.build(post_params.merge(user_id: current_user.id))
    # Save the post
    if @post.save
---
INSERT INTO "posts" ("title", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test date1"], ["description", "test date2"], ["price", 0.0], ["user_id", 2], ["created_at", "2016-09-12 03:15:21.043636"], ["updated_at", "2016-09-12 03:15:21.043636"]]

  def update
   @post.update(post_params)
---
UPDATE "posts" SET "price" = ?, "when_date" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["price", 150.0], ["when_date", "2016-09-14 20:21:00.000000"], ["updated_at", "2016-09-15 03:20:21.390825"], ["id", 6]]