app/controllers/users_controller.rb

    def show
      @user = User.find(params[:id])
      @user_posts = @user.posts.order(created_at: :desc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "bids" ON "posts"."id" = "bids"."post_id" WHERE "bids"."user_id" = ?  ORDER BY "posts"."created_at" DESC  [["user_id", 1]]